---
kind: other
id: Methods.T:Autodesk.Revit.DB.ElementIntersectsElementFilter
source: html/73bcb5d3-fdd3-76f1-475c-6e4dddf3d383.htm
---
# ElementIntersectsElementFilter Methods

Gets the target element.